# Metadata

```{yaml}
Course:   DS 5001 
Module:   02 Text Models
Topic:    Text into Data: Importing a Text, or, Clip, Chunk, and Split
Author:   R.C. Alvarado
```
**Purpose**:  Demonstrate how to tokenize a raw text and map an OHCO onto the resulting dataframe of tokens.

# Set Up

In [1]:
import pandas as pd

In [2]:
data_home = "../data"

In [3]:
text_file = f"{data_home}/gutenberg/pg105.txt"
csv_file = f"{data_home}/output/austen-persuasion.csv" # The file we will create

In [4]:
OHCO = ['chap_num', 'para_num', 'sent_num', 'token_num']

# Import file into a dataframe

In [5]:
LINES = pd.DataFrame(open(text_file, 'r', encoding='utf-8-sig').readlines(), columns=['line_str'])
LINES.index.name = 'line_num'
LINES.line_str = LINES.line_str.str.replace(r'\n+', ' ', regex=True).str.strip()

In [6]:
LINES.sample(20)

                                                   line_str
line_num
2541      the Cottage, where were only herself and the l...
7686      Captain Harville smiled, as much as to say, "D...
638       are not obliged to follow any, who can live in...
1486      recommended her musical powers to the notice o...
944       moreover, a single man at the time, she had a ...
2988      courtships in time of war.  How many days was ...
3451      "No, ma'am, he did not mention no particular f...
1838      when the child might be at rest for the night,...
2118      Gibraltar, with a recommendation from his form...
8697      have not met the solicitation requirements, we...
7214      had a famous set-to at rat-hunting all the mor...
7207
3082      consent; and when it came to be rationally con...
4716      have struck her, especially as it did not appe...
5508      "That I will, with all my heart, and farther, ...
4216      interrupted him. "I declare, Charles, I never ...
789       He was not Mr Wentworth, the former curate of ...
4057      Captain Wentworth had been in Kellynch yesterd...
8177      strong sense of duty is no bad part of a woman...
5            with this eBook or online at www.gutenberg.net

# Extract Title

In [7]:
title = LINES.loc[0].line_str.replace('The Project Gutenberg EBook of ', '')

In [8]:
print(title)

Persuasion, by Jane Austen

# Clip Cruft

In [9]:
clip_pats = [
    r"\*\*\*\s*START OF (?:THE|THIS) PROJECT", 
    r"\*\*\*\s*END OF (?:THE|THIS) PROJECT"
]

In [10]:
pat_a = LINES.line_str.str.match(clip_pats[0])
pat_b = LINES.line_str.str.match(clip_pats[1])

In [11]:
line_a = LINES.loc[pat_a].index[0] + 1
line_b = LINES.loc[pat_b].index[0] - 1

In [12]:
line_a, line_b

(19, 8372)

In [13]:
LINES = LINES.loc[line_a : line_b]

In [14]:
LINES.head(10)

                                                   line_str
line_num
19
20
21
22
23        Produced by Sharon Partridge and Martin Ward. ...
24                                            by Al Haines.
25
26
27
28

In [15]:
LINES.tail(10)

                                                   line_str
line_num
8363
8364
8365
8366
8367
8368
8369
8370
8371      End of the Project Gutenberg EBook of Persuasi...
8372

# Chunk by chapter

## Find all chapter headers

The regex will depend on the source text. You need to investigate the source text to figure this out.

In [16]:
chap_pat = r"^\s*(?:chapter|letter)\s+\d+"

In [17]:
chap_lines = LINES.line_str.str.match(chap_pat, case=False) # Returns a truth vector

In [18]:
LINES.loc[chap_lines] # Use as filter for dataframe

            line_str
line_num
47         Chapter 1
306        Chapter 2
500        Chapter 3
786        Chapter 4
959        Chapter 5
1297       Chapter 6
1657       Chapter 7
1992       Chapter 8
2346       Chapter 9
2632      Chapter 10
3020      Chapter 11
3314      Chapter 12
3876      Chapter 13
4150      Chapter 14
4409      Chapter 15
4677      Chapter 16
4912      Chapter 17
5248      Chapter 18
5654      Chapter 19
5905      Chapter 20
6265      Chapter 21
6970      Chapter 22
7555      Chapter 23
8208      Chapter 24

## Assign numbers to chapters

In [19]:
LINES.loc[chap_lines, 'chap_num'] = [i+1 for i in range(LINES.loc[chap_lines].shape[0])]

In [20]:
LINES.loc[chap_lines]

            line_str  chap_num
line_num
47         Chapter 1       1.0
306        Chapter 2       2.0
500        Chapter 3       3.0
786        Chapter 4       4.0
959        Chapter 5       5.0
1297       Chapter 6       6.0
1657       Chapter 7       7.0
1992       Chapter 8       8.0
2346       Chapter 9       9.0
2632      Chapter 10      10.0
3020      Chapter 11      11.0
3314      Chapter 12      12.0
3876      Chapter 13      13.0
4150      Chapter 14      14.0
4409      Chapter 15      15.0
4677      Chapter 16      16.0
4912      Chapter 17      17.0
5248      Chapter 18      18.0
5654      Chapter 19      19.0
5905      Chapter 20      20.0
6265      Chapter 21      21.0
6970      Chapter 22      22.0
7555      Chapter 23      23.0
8208      Chapter 24      24.0

Notice that all lines that are not chapter headers have no chapter number assigned to them.

In [21]:
LINES.sample(10)

                                                   line_str  chap_num
line_num
2941      were not at all tired, and Mary was either off...       NaN
3516      in making that poor fellow talk so much.  I wi...       NaN
31                                                                NaN
7928      Even if he did not come to Camden Place himsel...       NaN
7003      "I had not the smallest intention of asking hi...       NaN
6821                  recollect what you have seen him do."       NaN
5887      but in a short hurried call she excused hersel...       NaN
5133      Anne kept her appointment; the others kept the...       NaN
4243      told him the distance and the road, and I told...       NaN
1673      were actually setting forward for the Great Ho...       NaN

## Forward-fill chapter numbers to following text lines

`ffill()` will replace null values with the previous non-null value.

In [22]:
LINES.chap_num = LINES.chap_num.ffill()

In [23]:
LINES.sample(10)

                                                   line_str  chap_num
line_num
5920                                                             20.0
2140      sake.  I wished for him again the next summer,...       8.0
3894      persuaded to go early to their inn last night....      13.0
4204      everybody to be living in Uppercross; and when...      14.0
1398      sometimes.  I assure you, Miss Anne, it preven...       6.0
434       not in perfectly good spirits the only winter ...       2.0
1797                                                              7.0
63        "Walter Elliot, born March 1, 1760, married, J...       1.0
2878                                                             10.0
7132      She then found that it consisted of Mrs Musgro...      22.0

Notice that the lines taht precede our first chapter have no chapters, which is what we want. We need to decide whether to keep these lines as textual front matter or to dispose of them.

In [24]:
LINES.head(20)

                                                   line_str  chap_num
line_num
19                                                                NaN
20                                                                NaN
21                                                                NaN
22                                                                NaN
23        Produced by Sharon Partridge and Martin Ward. ...       NaN
24                                            by Al Haines.       NaN
25                                                                NaN
26                                                                NaN
27                                                                NaN
28                                                                NaN
29                                                                NaN
30                                                                NaN
31                                                                NaN
32                                                                NaN
33                                                                NaN
34                                                                NaN
35                                               Persuasion       NaN
36                                                                NaN
37                                                                NaN
38                                                       by       NaN

## Clean up

In [25]:
LINES = LINES.dropna(subset=['chap_num']) # Remove everything before Chapter 1
# LINES = LINES.loc[~LINES.chap_num.isna()] # Remove everything before Chapter 1 (alternate method)
LINES = LINES.loc[~chap_lines] # Remove chapter heading lines; their work is done
LINES.chap_num = LINES.chap_num.astype('int') # Convert chap_num from float to int

In [26]:
LINES.sample(10)

                                                   line_str  chap_num
line_num
5198      did not believe.  The same image of Mr Elliot ...        17
8257                    a new set of opinions and of hopes.        24
6383      be of even the slightest use to you," replied ...        21
5912      Captain Wentworth walked in alone.  Anne was t...        20
3957      or even notice through the misty glasses the l...        13
6256      ago; three hours ago!  For a moment the gratif...        20
4651      The folly of the means they often employ is on...        15
6621      When one lives in the world, a man or woman's ...        21
244       marriage might, perhaps, as there was no reaso...         1
6915      incumbrances, might be recoverable by proper m...        21

## Group lines into chapters

In [27]:
OHCO[:1]

['chap_num']

In [28]:
CHAPS = LINES.groupby(OHCO[:1]).line_str.apply(lambda x: '\n'.join(x)).to_frame('chap_str') # Make big string for each chapter

In [29]:
CHAPS.head(10)

                                                   chap_str
chap_num
1         \n\nSir Walter Elliot, of Kellynch Hall, in So...
2         \n\nMr Shepherd, a civil, cautious lawyer, who...
3         \n\n"I must take leave to observe, Sir Walter,...
4         \n\nHe was not Mr Wentworth, the former curate...
5         \n\nOn the morning appointed for Admiral and M...
6         \n\nAnne had not wanted this visit to Uppercro...
7         \n\nA very few days more, and Captain Wentwort...
8         \n\nFrom this time Captain Wentworth and Anne ...
9         \n\nCaptain Wentworth was come to Kellynch as ...
10        \n\nOther opportunities of making her observat...

In [30]:
CHAPS['chap_str'] = CHAPS.chap_str.str.strip()

In [31]:
CHAPS.head(10)

                                                   chap_str
chap_num
1         Sir Walter Elliot, of Kellynch Hall, in Somers...
2         Mr Shepherd, a civil, cautious lawyer, who, wh...
3         "I must take leave to observe, Sir Walter," sa...
4         He was not Mr Wentworth, the former curate of ...
5         On the morning appointed for Admiral and Mrs C...
6         Anne had not wanted this visit to Uppercross, ...
7         A very few days more, and Captain Wentworth wa...
8         From this time Captain Wentworth and Anne Elli...
9         Captain Wentworth was come to Kellynch as to a...
10        Other opportunities of making her observations...

So, now we have our text grouped by chapters.

# Split chapters into paragraphs 

We use Pandas' convenient `.split()` method with `expand=True`, followed by `.stack()`.
Note that this creates zero-based indexes.

In [32]:
para_pat = r'\n\n+'

In [33]:
# CHAPS['chap_str'].str.split(para_pat, expand=True).head()

In [34]:
PARAS = CHAPS['chap_str'].str.split(para_pat, expand=True).stack()\
    .to_frame('para_str').sort_index()
PARAS.index.names = OHCO[:2]

In [35]:
PARAS.head()

                                                            para_str
chap_num para_num
1        0         Sir Walter Elliot, of Kellynch Hall, in Somers...
         1                                 "ELLIOT OF KELLYNCH HALL.
         2         "Walter Elliot, born March 1, 1760, married, J...
         3         Precisely such had the paragraph originally st...
         4         Then followed the history and rise of the anci...

In [36]:
PARAS['para_str'] = PARAS['para_str'].str.replace(r'\n', ' ', regex=True)
PARAS['para_str'] = PARAS['para_str'].str.strip()
PARAS = PARAS[~PARAS['para_str'].str.match(r'^\s*$')] # Remove empty paragraphs

In [37]:
PARAS.head()

                                                            para_str
chap_num para_num
1        0         Sir Walter Elliot, of Kellynch Hall, in Somers...
         1                                 "ELLIOT OF KELLYNCH HALL.
         2         "Walter Elliot, born March 1, 1760, married, J...
         3         Precisely such had the paragraph originally st...
         4         Then followed the history and rise of the anci...

# Split paragraphs into sentences

In [38]:
# sent_pat = r'[.?!;:"]+'
sent_pat = r'[.?!;:]+'
SENTS = PARAS['para_str'].str.split(sent_pat, expand=True).stack()\
    .to_frame('sent_str')
SENTS.index.names = OHCO[:3]

In [39]:
SENTS = SENTS[~SENTS['sent_str'].str.match(r'^\s*$')] # Remove empty paragraphs
SENTS.sent_str = SENTS.sent_str.str.strip() # CRUCIAL TO REMOVE BLANK TOKENS

In [40]:
SENTS.head()

                                                                     sent_str
chap_num para_num sent_num
1        0        0         Sir Walter Elliot, of Kellynch Hall, in Somers...
                  1         there he found occupation for an idle hour, an...
                  2         there his faculties were roused into admiratio...
                  3         there any unwelcome sensations, arising from d...
                  4         and there, if every other leaf were powerless,...

# Split sentences into tokens

In [41]:
token_pat = r"[\s',-]+"
TOKENS = SENTS['sent_str'].str.split(token_pat, expand=True).stack()\
    .to_frame('token_str')

In [42]:
TOKENS.index.names = OHCO[:4]

In [43]:
TOKENS

                                       token_str
chap_num para_num sent_num token_num
1        0        0        0                 Sir
                           1              Walter
                           2              Elliot
                           3                  of
                           4            Kellynch
...                                          ...
24       13       0        6                  of
                           7          Persuasion
                           8                  by
                           9                Jane
                           10             Austen

[85014 rows x 1 columns]

# Extract Vocabulary

In [44]:
TOKENS['term_str'] = TOKENS.token_str.replace(r'[\W_]+', '', regex=True).str.lower()
VOCAB = TOKENS.term_str.value_counts().to_frame('n').reset_index().rename(columns={'index':'term_str'})
VOCAB.index.name = 'term_id'

In [45]:
VOCAB

           term_str     n
term_id
0               the  3330
1                to  2808
2               and  2800
3                of  2572
4                 a  1595
...             ...   ...
5755          joins     1
5756         blains     1
5757     undervalue     1
5758        waggons     1
5759      finishing     1

[5760 rows x 2 columns]

# Gathering by Content Object

In [46]:
def gather(ohco_level):
    global TOKENS
    level_name = OHCO[ohco_level-1].split('_')[0]
    df = TOKENS.groupby(OHCO[:ohco_level])\
        .token_str.apply(lambda x: x.str.cat(sep=' '))\
        .to_frame(f"{level_name}_str")
    return df

In [47]:
gather(1)

                                                   chap_str
chap_num
1         Sir Walter Elliot of Kellynch Hall in Somerset...
2         Mr Shepherd a civil cautious lawyer who whatev...
3         "I must take leave to observe Sir Walter " sai...
4         He was not Mr Wentworth the former curate of M...
5         On the morning appointed for Admiral and Mrs C...
6         Anne had not wanted this visit to Uppercross t...
7         A very few days more and Captain Wentworth was...
8         From this time Captain Wentworth and Anne Elli...
9         Captain Wentworth was come to Kellynch as to a...
10        Other opportunities of making her observations...
11        The time now approached for Lady Russell s ret...
12        Anne and Henrietta finding themselves the earl...
13        The remainder of Anne s time at Uppercross com...
14        Though Charles and Mary had remained at Lyme m...
15        Sir Walter had taken a very good house in Camd...
16        There was one point which Anne on returning to...
17        While Sir Walter and Elizabeth were assiduousl...
18        It was the beginning of February and Anne havi...
19        While Admiral Croft was taking this walk with ...
20        Sir Walter his two daughters and Mrs Clay were...
21        Anne recollected with pleasure the next mornin...
22        Anne went home to think over all that she had ...
23        One day only had passed since Anne s conversat...
24        Who can be in doubt of what followed When any ...

In [48]:
gather(2)

                                                            para_str
chap_num para_num
1        0         Sir Walter Elliot of Kellynch Hall in Somerset...
         1                                  "ELLIOT OF KELLYNCH HALL
         2         "Walter Elliot born March 1 1760 married July ...
         3         Precisely such had the paragraph originally st...
         4         Then followed the history and rise of the anci...
...                                                              ...
24       9         Anne satisfied at a very early period of Lady ...
         10        Her recent good offices by Anne had been enoug...
         11        Mrs Smith s enjoyments were not spoiled by thi...
         12                                                    Finis
         13        End of the Project Gutenberg EBook of Persuasi...

[1008 rows x 1 columns]

In [49]:
gather(3)

                                                                     sent_str
chap_num para_num sent_num
1        0        0         Sir Walter Elliot of Kellynch Hall in Somerset...
                  1         there he found occupation for an idle hour and...
                  2         there his faculties were roused into admiratio...
                  3         there any unwelcome sensations arising from do...
                  4         and there if every other leaf were powerless h...
...                                                                       ...
24       11       4         Anne was tenderness itself and she had the ful...
                  5         His profession was all that could ever make he...
                  6         She gloried in being a sailor s wife but she m...
         12       0                                                     Finis
         13       0         End of the Project Gutenberg EBook of Persuasi...

[5612 rows x 1 columns]

# Save work to CSV

This is important -- will be used for homework.

In [50]:
TOKENS.to_csv(csv_file)

# Use Library

In [51]:
import sys
sys.path.append("../lib")
from textimporter import TextImporter

In [52]:
pg105 = TextImporter(src_file=text_file, ohco_pats=[('chap', chap_pat, 'm')], clip_pats=clip_pats)
pg105.import_source()
pg105.parse_tokens()
pg105.extract_vocab()

Importing  ../data/gutenberg/pg105.txt
Clipping text
Parsing OHCO level 0 chap_id by milestone ^\s*(?:chapter|letter)\s+\d+
Parsing OHCO level 1 para_num by delimitter \n\n
Parsing OHCO level 2 sent_num by delimitter [.?!;:]+
Parsing OHCO level 3 token_num by delimitter [\s',-]+

In [53]:
pg105.TOKENS

                                      token_str    term_str
chap_id para_num sent_num token_num
1       0        0        0                 Sir         sir
                          1              Walter      walter
                          2              Elliot      elliot
                          3                  of          of
                          4            Kellynch    kellynch
...                                         ...         ...
24      17       0        7                  of          of
                          8          Persuasion  persuasion
                          9                  by          by
                          10               Jane        jane
                          11             Austen      austen

[84904 rows x 2 columns]

In [54]:
pg105.VOCAB

               n  n_chars         p             s          i         h
term_str
the         3330        3  0.039221     25.496697   4.672238  0.183249
to          2808        2  0.033073     30.236467   4.918218  0.162658
and         2800        3  0.032978     30.322857   4.922334  0.162331
of          2572        2  0.030293     33.010886   5.044870  0.152824
a           1595        1  0.018786     53.231348   5.734204  0.107722
...          ...      ...       ...           ...        ...       ...
joins          1        5  0.000012  84904.000000  16.373545  0.000193
blains         1        6  0.000012  84904.000000  16.373545  0.000193
undervalue     1       10  0.000012  84904.000000  16.373545  0.000193
waggons        1        7  0.000012  84904.000000  16.373545  0.000193
finishing      1        9  0.000012  84904.000000  16.373545  0.000193

[5760 rows x 6 columns]